app/controllers/firstname_controller.rb

INSERT INTO "firstnames" ("count", "created_at", "name", "rank", "updated_at", "year") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["count", 1234], ["created_at", Sun, 05 May 2013 17:01:18 UTC +00:00], ["name", "Michael"], ["rank", 1], ["updated_at", Sun, 05 May 2013 17:01:18 UTC +00:00], ["year", "index"]]
---
    def create
        @firstname = Firstname.new(
          :name => params[:name],
          :rank => params[:rank].to_i,
          :count => params[:count].to_i,
          :sex => params[:sex],
          :year => params[:year]
        )
        if @firstname.save